Repository: KDE/kjournald
Catalog: po/*/kjournald.po
Languages: fr, ia, ru

# @title Displayed program name
source: KJournald Browser
fr: Navigateur de KJournald
ia: KJournald Browser (Navigator KJournald)
ru: Браузер KJournald

# @title KAboutData: short program description
source: Viewer for Journald logs
fr: Afficheur pour les journaux de « Journald »
ia: Visor per registros (logs) de journald
ru: Средство просмотра журналов Journald

# @info:credit
source: (c) 2021-2025 The KJournald Developers
fr: (c) 2021 - 2025 L'équipe de développement de KJournald
ia: (c) 2021-2025 Le Disveloppatores de KJournald
ru: © Разработчики KJournald, 2021–2025

# @title Short program description
source: Viewer for Journald databases, which are generated by the Journald logging tool.
fr: Afficheur pour les journaux de « Journald », produits par l'outil de journalisation de « Journald »
ia: Visor per base de datos de journald, que es generate per le instrumento de registrar (logging) journald.
ru: Средство просмотра баз данных Journald, создаваемых инструментом журналирования Journald.

# @info:credit Role
source: Original Author
fr: Auteur original
ia: Autor original
ru: Первоначальный автор

# NAME OF TRANSLATORS
source: Your names
fr: Xavier Besnard
ia: Giovanni Sora
ru: Олеся Герасименко

# EMAIL OF TRANSLATORS
source: Your emails
fr: xavier.besnard@kde.org
ia: g.sora@tiscali.it
ru: translation-team@basealt.ru

source: Journald Log Viewer
fr: Afficheur du journal de KJournald
ia: Visor deRegistro de Journald
ru: Просмотр журнала Journald

# Radio box option, log priority value
source: Emergency
fr: Urgence
ia: Emergentia
ru: Cистема не работоспособна

# Radio box option, log priority value
source: Alert
fr: Alerte
ia: Alerta
ru: Cистема требует немедленного вмешательства

# Radio box option, log priority value
source: Critical
fr: Critique
ia: Critic
ru: Cостояние системы критическое

# Radio box option, log priority value
source: Error
fr: Erreur
ru: Cообщения об ошибках

# Radio box option, log priority value
source: Warning
fr: Avertissement
ia: Aviso
ru: Предупреждения о возможных проблемах

# Radio box option, log priority value
source: Notice
fr: Information
ia: Aviso
ru: Cообщения о нормальных, но важных событиях

# Radio box option, log priority value
source: Info
fr: Informations
ru: Информационные сообщения

# Radio box option, log priority value
source: Debug
fr: Déboguer
ia: Cribra (debug)
ru: Отладочные сообщения

# Radio box option, log priority value
source: No Filter
fr: Aucun filtre
ia: Necun filtro
ru: Без фильтра

# Section title for log message source
source: Transport
fr: Véhicule
ia: Transporto
ru: Транспорт

# Checkbox option for kernel log messages
source: Kernel
fr: Noyau
ru: Ядро

# Section title for log message priority
source: Priority
fr: Priorité
ia: Prioritate
ru: Приоритет

# Section title for systemd user unit
source: User Unit
fr: Unité utilisateur
ia: Unitate de usator
ru: Пользовательская служба

# Section title for systemd sytem unit
source: System Unit
fr: Unité système
ia: Unitate de Systema
ru: Системная служба

# Section title for process list
source: Process
fr: Processus
ia: Processo
ru: Процесс

# @info:tooltip
source: Expanded
fr: Développé
ia: Expandite
ru: Развёрнуто

# @info:tooltip
source: Collapsed
fr: Réduit
ia: Plicate
ru: Свёрнуто

# @label
source: Clear
fr: Effacer
ia: Netta
ru: Очистить

# @title:menu
source: File
fr: Fichier
ru: Файл

# @action:inmenu
source: Local journal
fr: Journal local
ia: Jornal local
ru: Локальный журнал

# @action:inmenu
source: Open from folder
fr: Ouvrir à partir du dossier
ia: Aperi ab Dossier
ru: Открыть из папки

# @action:inmenu
source: Open from file
fr: Ouvrir à partir du fichier
ia: Aperi ab File
ru: Открыть из файла

# @action:inmenu
source: Close
fr: Fermer
ia: Claude
ru: Закрыть

# @title:menu
source: Current Journal
fr: Journal courant
ia: Jornal currente
ru: Текущий журнал

# @title:menu
source: Limit Accessed Logs
fr: Limiter les journaux consultés
ia: Limita Registros (logs) accessite
ru: Ограничить доступные журналы

# @item:inmenu
source: All logs
fr: Tous les journaux
ia: Omne registros (logs)
ru: Все журналы

# @item:inmenu
source: Only current user logs
fr: Uniquement les journaux de l'utilisateur actuel
ia: Solmente registros (logs) de usator currente
ru: Только журналы текущего пользователя

# @item:inmenu
source: Only system logs
fr: Uniquement les journaux du système
ia: Solmente registros (logs) de systema
ru: Только системные журналы

# @title:menu
source: View
fr: Affichage
ia: Vista
ru: Вид

# @title:menu
source: Timestamp Display
fr: Affichage de l'horodatage
ia: Monstrator de Marcator de tempore
ru: Показ временной метки

# @item:inmenu
source: Localized Realtime
fr: Temps réel localisé
ia: Tempore real localisate
ru: Местное реальное время

# @item:inmenu
source: UTC Realtime
fr: Temps réel « UTC »
ia: Tempore real UTC
ru: Реальное время UTC

# @item:inmenu
source: Monotonic Time
fr: Temps monotonique
ia: Tempore Monotone
ru: Монотонное время

# @title:menu
source: Colorize
fr: Colorer
ru: Окрасить

# @item:inmenu
source: Systemd Unit
fr: Unité « systemd »
ia: Unitate de Systemd
ru: Модуль systemd

# @item:inmenu
source: Executable
fr: Exécutable
ia: Executabile
ru: Исполняемый файл

# @title:menu
source: Grouping
fr: Regroupement
ia: Gruppar
ru: Группировка

# @item:inmenu
source: Group templated services
fr: Regrouper les services avec modèle
ia: Gruppa Servicios basate sur patronos
ru: Группировать шаблонные сервисы

# @item:inmenu
source: Do not group templated service
fr: Ne pas regrouper les services avec modèle
ia: Non gruppar servicios basate sur patronos
ru: Не группировать шаблонные службы

# @title:menu
source: Help
fr: Aide
ia: Adjuta
ru: Справка

# @label
source: Kernel
fr: Noyau
ru: Ядро

# @label
source: Boot:
fr: Démarrage :
ru: Загрузка:

# @info:tooltip
source: Switch between case sensitive and case insensitive matching
fr: Basculer entre une correspondance sensible et non sensible à la casse
ia: Commuta inter considera o non considera majusculas e minusculas
ru: Переключение между регистрозависимым и регистронезависимым режимами

# @info:tooltip
source: Switch to browsing mode
fr: Basculer en mode « Navigation »
ia: Commuta a modo de navigar
ru: Перейти в режим просмотра

# @info:tooltip
source: Switch to selection mode
fr: Basculer en mode « Sélection »
ia: Commuta a modo de selection
ru: Перейти в режим выделения

# @title
source: Select journal folder
fr: Sélectionner un dossier de journal
ia: Selige dossier de jornal
ru: Выбрать папку журнала

# @title
source: Select journal file
fr: Sélectionner un fichier de journal
ia: Selige file de Jornal
ru: Выбрать файл журнала

# @item
source: Journal files (*.journal)
fr: Fichiers de journal (*.journal)
ia: Files de Jornal (*.journal)
ru: Файлы журнала (*.journal)

# @item
source: All files (*)
fr: Tous les fichiers (*)
ia: Omne files (*)
ru: Все файлы (*)

# @title
source: Unable to load journal database from selected location:
fr: Impossible de charger la base de données de journal à partir de l'emplacement sélectionné :
ia: Incapace a cargar base de datos de jornal ex location seligite:
ru: Не удалось загрузить базу данных журнала из выбранного расположения:

# @info
source: Check sub-directories of selected directory to contain files ending with '.journal'.
fr: Vérifiez que les sous-dossiers du dossier sélectionné contiennent des fichiers avec l'extension « .journal ».
ia: Marca sub-directorios de directorio seligite percontiner files terminante con 'journal'.
ru: Проверьте вложенные каталоги выбранного каталога на наличие файлов с расширением '.journal'.

# @info:tooltip
source: No log entries apply to selected filters.
fr: Aucune entrée de journal ne correspond aux filtres sélectionnés.
ia: Non applica alcun entratas de Registro (log)afiltros seligite.
ru: Отсутствуют записи журнала, соответствующие выбранным фильтрам.

# @title:window
source: Configure Remote Journal Server
fr: Configurer le serveur distant de journal
ia: Configura Servitor de Jornal Remote
ru: Настройка удалённого сервера журнала

# @label
source: URL:
ru: URL-адрес:

# @label
source: Port:
ia: Porto:
ru: Порт:

# @action:inmenu
source: Local Journal
fr: Journal local
ia: Jornal local
ru: Локальный журнал

# @action:inmenu
source: Open from Folder
fr: Ouvrir à partir du dossier
ia: Aperi ab Dossier
ru: Открыть из папки

# @action:inmenu
source: Open from File
fr: Ouvrir à partir du fichier
ia: Aperi ab File
ru: Открыть из файла

# @action:inmenu
source: Copy Current View
fr: Copier la vue actuelle
ia: Copia vista currente
ru: Скопировать текущее представление
